{
  "home": {
    "name": "Antonio Della Porta",
    "title": "Software Engineering for AI Researcher",
    "shortBio": "Translating AI-speak into human-speak, because 'beep boop' isn't a satisfactory explanation.",
    "photoUrl": "photo.jpg",
    "fullBio": [
    "Hello! 👋 I'm Antonio Della Porta, a Software Engineer passionate about innovative technologies and cutting-edge software solutions💻.",
    "In 2018, I dove into the world of programming and software development through my Bachelor's degree🚀. My fascination with advanced computing led me to complete a thesis on Quantum Computing 🔬, exploring this non-deterministic computation model.",
    "Driven by curiosity, I pursued a Master's degree in Software Engineering and IT Management🛠️. My master's thesis focused on developing a novel, tool-supported inspection procedure for diagnosing community smells, bridging theoretical concepts with practical applications🔍🤝.",
    "Throughout the years of my academic journey, I've also worked as a Software Engineer applying my skills to real-world, large-scale data management projects for multinational companies🏢📊. Currently, I'm delving deep into the fascinating field of Explainable AI (XAI) and Prompt Engineering🧠💡.",
    "I'm exploring ways to make complex AI models more transparent and interpretable, aiming to bridge the gap between powerful machine learning algorithms and human understanding. My focus is on developing techniques that can provide clear, understandable explanations for AI decisions, crucial for building trust and enabling wider adoption of AI systems across various domains🔍🤖.",
    "I'm passionate about pushing the boundaries of software engineering and AI, with a particular interest in innovative technologies, data management, and improving both AI systems and developer communities🔮💡. I'm always excited to take on new challenges and contribute to the ever-evolving fields of Computer Science and Artificial Intelligence🌟."
    ]
  },
  "experience": [
    {
      "title": "Bachelor Degree in Computer Science",
      "company": "University of Salerno",
      "startDate": "September 2018",
      "endDate": "October 2021",
      "description": "Core CS principles, algorithms, and software development. Key projects in web development and database design."
    },
    {
      "title": "Master Degree in Software Engineering and IT Management",
      "company": "University of Salerno",
      "startDate": "October 2021",
      "endDate": "September 2023",
      "description": "Advanced studies in SE practices and IT governance. Thesis on AI-driven software architecture optimization."
    },
    {
      "title": "Software Engineer",
      "company": "Minsait",
      "startDate": "June 2021",
      "endDate": "December 2023",
      "description": "Developed enterprise solutions. Focused on data analytics and cloud migration projects."
    },
    {
      "title": "Research Assistant",
      "company": "SeSaLab @ University of Salerno",
      "startDate": "January 2024",
      "endDate": "October 2024",
      "description": "Researching XAI in software development. Focus on AI-driven code analysis and optimization techniques."
    },
    {
      "title": "Ph.D Student",
      "company": "SeSaLab @ University of Salerno",
      "startDate": "November 2024",
      "endDate": "Present",
      "description": "Researching XAI in software development. Focus on AI-driven code analysis and optimization techniques."
    }
  ]
}
